package com.ftrue.day04;

/*
	循环嵌套:当一个循环语句中存在另外一个循环语句

	for循环语句的嵌套格式:
		for (外层循环的初始化语句;外层循环的循环条件语句;外层循环的迭代语句) {
			for (内层循环的初始化语句;内层循环的循环条件语句;内层循环的迭代语句) {
				内层循环的循环体语句;
			}
		}

	执行流程:
		1.执行外层循环的初始化语句;
		2.看外层循环的循环条件语句的结果是true还是false
		3.如果是false,循环嵌套语句结束;
		  如果是true,执行第a步;
		  a.执行内层循环的初始化语句;
		  b.看内层循环的循环条件语句的结果是true还是false
		  c.如果是false,执行第4步;
		    如果是true,执行内层循环的循环体语句
		  d.执行内层循环的迭代语句;
		  e.跳回第b步,继续执行
		4.执行外层循环的迭代语句;
		5.跳回第2步,继续执行

	需求:打印1天中的时间

	注意事项:
		在循环嵌套过程中,外层循环的初始化语句执行了1次
		在循环嵌套过程中,内层循环的初始化语句执行了(外层循环的次数)次
		在循环嵌套过程中,内层循环的循环体语句执行了(外层循环的次数*内层循环的次数)次
*/

public class BasicDemo04 {
	public static void main (String[] args) {
		for (int hour = 0; hour < 24 ; hour++ ) {
			for (int min = 0; min < 60 ; min++ ) {
				System.out.println(hour + "时" + min + "分");
			}
		}
	}
}